index.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil expand-links:t f:t
#+options: inline:t num:nil p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: alexforsale's literate Emacs configuration 2.0
#+date: <2025-09-06 Sat>
#+author: Kristian Alexander P
#+email: alexforsale@yahoo.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 30.2 (Org mode 9.7.11)
#+cite_export:
#+export_file_name: index.html
#+startup: overview
#+setupfile: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+HTML_HEAD: <style> p{max-width:800px;}</style>
#+HTML_HEAD: <style> li{max-width:800px;}</style>
* The new configuration

My old configuration got bloated after accumulating external packages, and sometimes it's just a test package that I forgot to remove, or some packages I've added that I don't really use.

So this time I want to really focus on the builtins, and only the builtins that I really use.
* early-init.el
:PROPERTIES:
:header-args: :tangle ./early-init.el
:END:
** header :noexport:
#+begin_src emacs-lisp
  ;;; early-init --- `Emacs' Initialization file -*- lexical-binding: t -*-
  ;;; Commentary:
  ;;; Code:
#+end_src
** GC Threshold
A common way of speeding up /Emacs/ startup. The variable =gc-cons-threshold= is the number of bytes consing between garbage collection.
Garbage collection can happen automatically once this many bytes have been allocated since the last garbage collection.
Here I set this to a variable =most-positive-fixnum= which value is set automatically.
#+begin_src emacs-lisp :tangle no :exports both
  most-positive-fixnum
#+end_src

#+RESULTS:
: 2305843009213693951

#+begin_src emacs-lisp
  (setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)
#+end_src
The =gc-cons-percentage= default to 0.1, is the portion of the heap used for allocation.

I set the value differently when /Emacs/ is starting up, by setting this variable into =emacs-startup-hook= that runs after /Emacs/ loaded the init files.
#+begin_src emacs-lisp
  (add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 16 1024 1024) ; 16mb
                  gc-cons-percentage 0.1)))
#+end_src
** Language
Set UTF-8 as the default coding system
#+begin_src emacs-lisp
  (set-language-environment "UTF-8")
#+end_src
** Set initial frame
Here I disable the menu-bar, tool-bar and vertical scroll bar.
#+begin_src emacs-lisp
  (add-to-list 'default-frame-alist '(menu-bar-lines . 0))
  (add-to-list 'initial-frame-alist '(menu-bar-lines . 0))

  (add-to-list 'initial-frame-alist '(tool-bar-lines . 0))
  (add-to-list 'default-frame-alist '(tool-bar-lines . 0))

  (add-to-list 'initial-frame-alist '(vertical-scroll-bars))
  (add-to-list 'default-frame-alist '(vertical-scroll-bars))

  (add-to-list 'initial-frame-alist '(fullscreen . maximized))
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

  (add-to-list 'initial-frame-alist
  			 '(font . "Iosevka Nerd Font Mono-8"))
  (add-to-list 'default-frame-alist
  			 '(font . "Iosevka Nerd Font Mono-8"))
#+end_src
** Define the location of =custom-file=
The =custom-file= is used to save customization settings for future use.
#+begin_src emacs-lisp
  (customize-set-variable 'custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file))
#+end_src
** Setup package
Now much more simpler since [[https://github.com/jwiegley/use-package][use-package]] is built into /Emacs/. It's actually not used since I'm using =straight.el=.
#+begin_src emacs-lisp
    (with-eval-after-load 'package
      (setq package-enable-at-startup nil)
      ;; Add `melpa` to `package-archives`.
      (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/") t)
      ;; gnu-devel
      (add-to-list 'package-archives '("gnu-devel" . "https://elpa.gnu.org/devel/") t)
      (add-to-list 'package-archives '("nongnu" . "https://elpa.nongnu.org/nongnu/") t)
      (package-initialize))
#+end_src
** footer :noexport:
#+begin_src emacs-lisp
  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src
* init.el
:PROPERTIES:
:header-args: :tangle ./init.el
:END:
** header :noexport:
#+begin_src emacs-lisp
  ;;; init --- `Emacs' Initialization file -*- lexical-binding: t -*-
  ;;; Commentary:
  ;;; Code:
#+end_src
** Tangle this org-file
This file is already added in my git repositories for initial Emacs loading. But I also include it here to make sure there's no changes made.
#+begin_src emacs-lisp
  (require 'ob-tangle)

  (when (file-exists-p (expand-file-name "index.org" user-emacs-directory))
    (org-babel-tangle-file (expand-file-name "index.org" user-emacs-directory)))
#+end_src
** Variables and helper functions
*** Identity
#+name: identity
#+begin_src emacs-lisp :noweb-ref minimal-config :noweb-sep "\n\n"
  (setq user-mail-address "alexforsale@yahoo.com"
        user-full-name "Kristian Alexander P")
#+end_src

*** merge-list-to-list function
This function is just a wrapper to easily merge lists. I don't think I need it anymore.
#+name: merge-list-to-list
#+begin_src emacs-lisp
  ;;; From https://emacs.stackexchange.com/questions/38008/adding-many-items-to-a-list/68048#68048
  (defun merge-list-to-list (dst src)
    "Merges content of the 2nd list with the 1st one"
    (set dst
         (append (eval dst) src)))
#+end_src
*** define +config/org-directory variable
#+name: +config/org-directory
#+begin_src emacs-lisp
  (cond ((file-directory-p (expand-file-name "Sync/org" (getenv "HOME")))
         (customize-set-variable '+config/org-directory (expand-file-name "Sync/org" (getenv "HOME"))))
        ((string-match-p "microsoft" (shell-command-to-string "uname -a"))
         (if (file-directory-p "/mnt/c/Users/SyncthingServiceAcct/Default Folder/org")
             (customize-set-variable '+config/org-directory "/mnt/c/Users/SyncthingServiceAcct/Default Folder/org"))))
#+end_src
I put my org files inside /syncthing/ default directory (=~/Sync= if on /Linux/) so it will automatically synced to all my devices. But on /windows/ WSL the location will vary depending on how you install /syncthing/ so I won't even bother set it up.
** Load each modular configuration file.
*** evil
:PROPERTIES:
:ID:       76f56dc0-309f-485d-b9b6-70971e90437d
:END:
All =evil-mode= specific configuration and =evil= related packages goes here.
#+begin_src emacs-lisp
  (require 'config-evil (expand-file-name "modules/config-evil.el" user-emacs-directory) t)
#+end_src
*** Keybinding
Most keybindings here depends on /evil-mode/, so it will be loaded after.
#+begin_src emacs-lisp
  (require 'config-keybinding (expand-file-name "modules/config-keybinding.el" user-emacs-directory) t)
#+end_src
*** general :noexport:archive:
#+begin_src emacs-lisp :tangle no
  (require 'config-general (expand-file-name "modules/config-general.el" user-emacs-directory) t)
#+end_src
All =general= keybindings are in this file.
*** UI
#+begin_src emacs-lisp
  (require 'config-ui (expand-file-name "modules/config-ui.el" user-emacs-directory) t)
#+end_src
Configuration for /Emacs/'s looks and feels.
*** builtins
#+begin_src emacs-lisp
  (require 'config-builtins (expand-file-name "modules/config-builtins.el" user-emacs-directory) t)
#+end_src
The more I understand the meat inside /Emacs/ the less external packages I'll use (hopefully).
*** completion
#+begin_src emacs-lisp
  (require 'config-completion (expand-file-name "modules/config-completion.el" user-emacs-directory) t)
#+end_src
For now this is for vertico and friends.
*** shells
#+begin_src emacs-lisp
  (require 'config-shells (expand-file-name "modules/config-shells.el" user-emacs-directory) t)
#+end_src
Mostly =vterm= configurations. =Eshell= looks promising, but still hard to configure.
*** editing
#+begin_src emacs-lisp
  (require 'config-editing (expand-file-name "modules/config-editing.el" user-emacs-directory) t)
#+end_src
Tweaks to make my editing experience nicer.
*** IDE
#+begin_src emacs-lisp
  (require 'config-ide (expand-file-name "modules/config-ide.el" user-emacs-directory) t)
#+end_src
All of =LSP=, =git=, =flycheck=, and =projectile= configuration.
*** org
#+begin_src emacs-lisp
  (require 'config-org (expand-file-name "modules/config-org.el" user-emacs-directory) t)
#+end_src
Most of my changes are in here, the more configurable =org-mode=, the more unusable to me.
*** tools
#+begin_src emacs-lisp
  (require 'config-tools (expand-file-name "modules/config-tools.el" user-emacs-directory) t)
#+end_src
Small packages that helps /Emacs/ interacts with its surrounding. I have =direnv=, =exec-path-from-shell= for, you guess it, shells. There's also =ox-hugo= for blogging with /hugo/.
*** dired
#+begin_src emacs-lisp
  (require 'config-dired (expand-file-name "modules/config-dired.el" user-emacs-directory) t)
#+end_src
I don't use =dired= that much, but when I do, I at least know my way around.
*** treemacs
#+begin_src emacs-lisp
  (require 'config-treemacs (expand-file-name "modules/config-treemacs.el" user-emacs-directory) t)
#+end_src
It's like /NERDtree/ in /vim/, but in /Emacs/, I kinda understand why /vim/ need this functionality. ~C-x C-f~ with =vertico= and =marginalia= already do the same in /Emacs/. So it's not important to me, but still nice to have.
*** mail
#+begin_src emacs-lisp
  (require 'config-mail (expand-file-name "modules/config-mail.el" user-emacs-directory) t)
#+end_src
Email in /Emacs/ with the help of /notmuch/, /offlineimap/, /afew/, and /davmail/ for my /Exchange/ mails.
*** programming modes
#+begin_src emacs-lisp
  (require 'config-progmodes (expand-file-name "modules/config-progmodes.el" user-emacs-directory) t)
#+end_src
Doing stuffs in /linux/ will eventually makes you edit files from various programming languages. This here is just to make me read them comfortly.
*** local overrides
#+begin_src emacs-lisp
  (require 'config-overrides (expand-file-name "modules/config-overrides.el" user-emacs-directory) t)
#+end_src
** footer :noexport:
#+begin_src emacs-lisp
  (provide 'init)
  ;;; init.el ends here
#+end_src
* Modules
** [[https://evil.readthedocs.io/][Evil]] :external:
:PROPERTIES:
:header-args: :tangle ./modules/config-evil.el :mkdirp t
:ID:       af30e16b-69ed-47ec-965c-224fc3d7d609
:END:
*** header :noexport:
#+begin_src emacs-lisp
  ;;; config-evil --- `evil-mode' configuration file -*- lexical-binding: t -*-
  ;;; Commentary:
  ;;; Code:
#+end_src
